# Rekall Memory Forensics
#
# Copyright 2013 Google Inc. All Rights Reserved.
#
# Authors:
# Michael Hale Ligh <michael.ligh@mnin.org>
#
# Contributors/References:
#   Richard Stevens and Eoghan Casey
#   Extracting Windows Cmd Line Details from Physical Memory.
#   http://ww.dfrws.org/2010/proceedings/stevens.pdf
#   Michael Cohen <scudette@gmail.com>
#
# This program is free software; you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation; either version 2 of the License, or (at
# your option) any later version.
#
# This program is distributed in the hope that it will be useful, but
# WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
# General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program; if not, write to the Free Software
# Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
#

# pylint: disable=protected-access
from rekall import obj
from rekall import utils
from rekall.plugins.overlays import basic
from rekall.plugins.windows import common
from rekall.plugins.windows import vadinfo
from rekall.plugins.overlays.windows import pe_vtypes

MAX_HISTORY_DEFAULT = 50
HISTORY_BUFFERS_DEFAULTS = 4

# The following all use these standard types.
common_types = {
    '_LIST_ENTRY' : [0x8, {
        'Flink' : [0x0, ['pointer', ['_LIST_ENTRY']]],
        'Blink' : [0x4, ['pointer', ['_LIST_ENTRY']]],
        }]}

common_types_64 = {
    '_LIST_ENTRY' : [0x10, {
        'Flink' : [0x0, ['pointer', ['_LIST_ENTRY']]],
        'Blink' : [0x8, ['pointer', ['_LIST_ENTRY']]],
        }]}

# Windows 7 Types from conhost.exe
conhost_types_x86 = {
    '_COMMAND': [None, {
        'CmdLength': [0x00, ['unsigned short']],
        'Cmd' : [0x02, ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.CmdLength
            )]],
        }],
    '_COMMAND_HISTORY': [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'Flags' : [0x08, ['Flags', dict(
            bitmap={
                'Allocated': 0,
                'Reset': 1
                }
            )]],
        'Application': [0x0C, ['Pointer', dict(
            target='UnicodeString',
            target_args=dict(
                encoding='utf16',
                length=256
                )
            )]],
        'CommandCount': [0x10, ['short']],
        'LastAdded': [0x12, ['short']],
        'LastDisplayed': [0x14, ['short']],
        'FirstCommand': [0x16, ['short']],
        'CommandCountMax': [0x18, ['short']],
        'ProcessHandle': [0x1C, ['unsigned int']],
        'PopupList': [0x20, ['_LIST_ENTRY']],
        'CommandBucket': [0x28, ['Array', dict(
            count=lambda x: x.CommandCount,
            target='Pointer',
            target_args=dict(
                target='_COMMAND'
                )
            )]],
        }],

    '_ALIAS': [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'SourceLength': [0x08, ['unsigned short']],
        'TargetLength': [0x0A, ['unsigned short']],
        'Source': [0x0C, ['Pointer', dict(
            target='UnicodeString',
            target_args=dict(
                encoding='utf16',
                length=lambda x: x.SourceLength * 2
                )
            )]],

        'Target': [0x10, ['Pointer', dict(
            target='UnicodeString',
            target_args=dict(
                encoding='utf16',
                length=lambda x: x.TargetLength * 2
                )
            )]],
        }],
    '_EXE_ALIAS_LIST' : [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'ExeLength': [0x08, ['unsigned short']],
        'ExeName': [0x0C, ['Pointer', dict(
            target='UnicodeString',
            target_args=dict(
                encoding='utf16',
                length=lambda x: x.ExeLength * 2
                )
            )]],
        'AliasList': [0x10, ['_LIST_ENTRY']],
        }],

    '_POPUP_LIST' : [None, {
        'ListEntry' : [0x00, ['_LIST_ENTRY']],
        }],

    '_CONSOLE_INFORMATION': [None, {
        'CurrentScreenBuffer': [0x98, ['pointer', ['_SCREEN_INFORMATION']]],
        'ScreenBuffer': [0x9C, ['pointer', ['_SCREEN_INFORMATION']]],
        'HistoryList': [0xD4, ['_LIST_ENTRY']],
        'ProcessList': [0x18, ['_LIST_ENTRY']], # SrvGetConsoleProcessList()
        'ExeAliasList': [0xDC, ['_LIST_ENTRY']], # GetConsoleAliasExes()

        # GetConsoleHistoryInfo()
        'HistoryBufferCount': [0xE4, ['unsigned short']],

        # GetConsoleHistoryInfo()
        'HistoryBufferMax': [0xE6, ['unsigned short']],

        'CommandHistorySize': [0xE8, ['unsigned short']],
        'OriginalTitle': [0xEC, ['Pointer', dict(
            target='UnicodeString',
            target_args=dict(
                encoding='utf16',
                length=256
                )
            )]], # GetConsoleOriginalTitle()

        'Title': [0xF0, ['Pointer', dict(
            target='UnicodeString',
            target_args=dict(
                encoding='utf16',
                length=256
                )
            )]], # GetConsoleTitle()
        }],

    '_CONSOLE_PROCESS': [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'ProcessHandle': [0x8, ['unsigned int']],
        }],
    '_SCREEN_INFORMATION': [None, {
        'ScreenX': [0x08, ['short']],
        'ScreenY': [0x0A, ['short']],
        'Rows': [0x3C, ['Pointer', dict(
            target='Array',
            target_args=dict(
                count=lambda x: x.ScreenY,
                target='_ROW'
                )
            )]],
        'Next': [0xDC, ['Pointer', dict(target='_SCREEN_INFORMATION')]],
        }],
    '_ROW': [0x1C, {
        'Chars': [0x08, ['Pointer', dict(
            target='UnicodeString',
            target_args=dict(
                encoding='utf16',
                length=lambda x: x.obj_parent.ScreenX * 2,
                )
            )]],
        }],
    }

# Windows 7 Types from conhost.exe
conhost_types_x64 = {
    '_COMMAND': [None, {
        'CmdLength': [0x00, ['unsigned short']],
        'Cmd' : [0x02, ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.CmdLength)]],
        }],
    '_COMMAND_HISTORY': [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],

        # AllocateCommandHistory()
        'Flags' : [0x10, ['Flags', {'bitmap': {'Allocated': 0, 'Reset': 1}}]],

        # AllocateCommandHistory()
        'Application': [0x18, ['Pointer', dict(
            target='UnicodeString',
            target_args=dict(
                encoding='utf16',
                length=256
                )
            )]],
        'CommandCount': [0x20, ['short']],
        'LastAdded': [0x22, ['short']],
        'LastDisplayed': [0x24, ['short']],
        'FirstCommand': [0x26, ['short']],
        'CommandCountMax': [0x28, ['short']], # AllocateCommandHistory()
        'ProcessHandle': [0x30, ['address']], # AllocateCommandHistory()
        'PopupList': [0x38, ['_LIST_ENTRY']], # AllocateCommandHistory()
        'CommandBucket': [0x48, ['Array', dict(
            count=lambda x: x.CommandCount,
            target='Pointer',
            target_args=dict(
                target='_COMMAND')
            )]],
        }],
    '_ALIAS': [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'SourceLength': [0x10, ['unsigned short']], # AddAlias()
        'TargetLength': [0x12, ['unsigned short']], # AddAlias()

        # reversed from AddAlias()
        'Source': [0x18, ['pointer', ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.SourceLength * 2)]]],

        'Target': [0x20, ['pointer', ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.TargetLength * 2
            )]]], # AddAlias()
        }],
    '_EXE_ALIAS_LIST' : [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'ExeLength': [0x10, ['unsigned short']], # AddExeAliasList()

        # AddExeAliasList()
        'ExeName': [0x18, ['pointer', ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.ExeLength * 2)]]],

        'AliasList': [0x20, ['_LIST_ENTRY']], # AddExeAliasList()
        }],
    '_POPUP_LIST' : [None, {
        'ListEntry' : [0x00, ['_LIST_ENTRY']],
        }],
    '_CONSOLE_INFORMATION': [None, {
        # MOV RCX, [RIP+0x25bb5]   conhost!gConsoleInformation+0x28
        'ProcessList': [0x28, ['_LIST_ENTRY']],
        'CurrentScreenBuffer': [0xE0, ['Pointer', dict(
            target='_SCREEN_INFORMATION'
            )]], # AllocateConsole()

        'ScreenBuffer': [0xE8, ['Pointer', dict(
            target='_SCREEN_INFORMATION'
            )]], # AllocateConsole()

        'HistoryList': [0x148, ['_LIST_ENTRY']], # AllocateCommandHistory()
        'ExeAliasList': [0x148, ['_LIST_ENTRY']], # SrvGetConsoleAliasExes()
        'HistoryBufferCount': [0x168, ['unsigned short']], # AllocateConsole()
        'HistoryBufferMax': [0x16A, ['unsigned short']], # AllocateConsole()
        'CommandHistorySize': [0x16C, ['unsigned short']], # AllocateConsole()

        'OriginalTitle': [0x170, ['Pointer', dict(
            target='UnicodeString',
            target_args=dict(
                encoding='utf16',
                length=256
                )
            )]], # SrvGetConsoleTitle()

        'Title': [0x178, ['Pointer', dict(
            target='UnicodeString',
            target_args=dict(
                encoding='utf16',
                length=256
                )
            )]], # SrvGetConsoleTitle()
        }],
    '_CONSOLE_PROCESS': [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'ProcessHandle': [0x10, ['unsigned int']], # FindProcessInList()
        }],

    '_SCREEN_INFORMATION': [None, {
        'ScreenX': [8, ['short']],
        'ScreenY': [10, ['short']],
        'Rows': [0x48, ['Pointer', dict(
            target="Array",
            target_args=dict(
                count=lambda x: x.ScreenY,
                target='_ROW'
                )
            )]],

        'Next': [0x128, ['pointer', ['_SCREEN_INFORMATION']]],
        }],
    '_ROW': [0x28, {
        'Chars': [0x08, ['pointer', ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.obj_parent.obj_parent.ScreenX * 2,
        )]]],
        }],
    }

# Windows XP, 2003, 2008, Vista from winsrv.dll
winsrv_types_x86 = {
    '_COMMAND': [None, {
        'CmdLength': [0x00, ['unsigned short']],
        'Cmd' : [0x02, ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.CmdLength
            )]],
        }],
    '_COMMAND_HISTORY': [None, {
        'Flags' : [0x00, ['Flags', {
            'bitmap': {
                'Allocated': 0,
                'Reset': 1
                }
            }]],
        'ListEntry': [0x04, ['_LIST_ENTRY']],
        'Application': [0x0C, ['pointer', ['UnicodeString', dict(
            encoding='utf16', length=256)]]],
        'CommandCount': [0x10, ['short']],
        'LastAdded': [0x12, ['short']],
        'LastDisplayed': [0x14, ['short']],
        'FirstCommand': [0x16, ['short']],
        'CommandCountMax': [0x18, ['short']],
        'ProcessHandle': [0x1C, ['unsigned int']],
        'PopupList': [0x20, ['_LIST_ENTRY']],
        'CommandBucket': [0x28, ['Array', dict(
            count=lambda x: x.CommandCount,
            target='Pointer',
            target_args=dict(
                target='_COMMAND'
                )
            )]],
        }],

    '_ALIAS': [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'SourceLength': [0x08, ['unsigned short']],
        'TargetLength': [0x0A, ['unsigned short']],
        'Source': [0x0C, ['pointer', ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.SourceLength * 2
            )]]],
        'Target': [0x10, ['pointer', ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.TargetLength * 2)]]],
        }],
    '_EXE_ALIAS_LIST' : [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'ExeLength': [0x08, ['unsigned short']],
        'ExeName': [0x0C, ['pointer', [
            'UnicodeString', dict(
                encoding='utf16',
                length=lambda x: x.ExeLength * 2)]]],
        'AliasList': [0x10, ['_LIST_ENTRY']],
        }],
    '_POPUP_LIST' : [None, {
        'ListEntry' : [0x00, ['_LIST_ENTRY']],
        }],
    '_CONSOLE_INFORMATION': [None, {
        'CurrentScreenBuffer': [0xB0, ['pointer', ['_SCREEN_INFORMATION']]],
        'ScreenBuffer': [0xB4, ['pointer', ['_SCREEN_INFORMATION']]],
        'HistoryList': [0x108, ['_LIST_ENTRY']],
        'ProcessList': [0x100, ['_LIST_ENTRY']],
        'ExeAliasList': [0x110, ['_LIST_ENTRY']],
        'HistoryBufferCount': [0x118, ['unsigned short']],
        'HistoryBufferMax': [0x11A, ['unsigned short']],
        'CommandHistorySize': [0x11C, ['unsigned short']],
        'OriginalTitle': [0x124, ['pointer', [
            'UnicodeString', dict(
                encoding='utf16',
                length=256)]]],
        'Title': [0x128, ['pointer', [
            'UnicodeString', dict(
                encoding='utf16',
                length=256
                )]]],
        }],
    '_CONSOLE_PROCESS': [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'ProcessHandle': [0x08, ['unsigned int']],
        'Process': [0x0C, ['pointer', ['_CSR_PROCESS']]],
        }],
    '_SCREEN_INFORMATION': [None, {
        'Console': [0x00, ['pointer', ['_CONSOLE_INFORMATION']]],
        'ScreenX': [0x24, ['short']],
        'ScreenY': [0x26, ['short']],
        'Rows': [0x58, ['pointer', [
            'array', lambda x: x.ScreenY, ['_ROW']]]],
        'Next': [0xF8, ['pointer', ['_SCREEN_INFORMATION']]],
        }],
    '_ROW': [0x1C, {
        'Chars': [0x08, ['pointer', [
            'UnicodeString', dict(
                encoding='utf16', length=256
                )]]],
        }],

    # this is a public PDB
    '_CSR_PROCESS' : [0x60, {
        'ClientId' : [0x0, ['_CLIENT_ID']],
        'ListLink' : [0x8, ['_LIST_ENTRY']],
        'ThreadList' : [0x10, ['_LIST_ENTRY']],
        'NtSession' : [0x18, ['pointer', ['_CSR_NT_SESSION']]],
        'ClientPort' : [0x1c, ['pointer', ['void']]],
        'ClientViewBase' : [0x20, ['pointer', ['unsigned char']]],
        'ClientViewBounds' : [0x24, ['pointer', ['unsigned char']]],
        'ProcessHandle' : [0x28, ['pointer', ['void']]],
        'SequenceNumber' : [0x2c, ['unsigned long']],
        'Flags' : [0x30, ['unsigned long']],
        'DebugFlags' : [0x34, ['unsigned long']],
        'ReferenceCount' : [0x38, ['unsigned long']],
        'ProcessGroupId' : [0x3c, ['unsigned long']],
        'ProcessGroupSequence' : [0x40, ['unsigned long']],
        'LastMessageSequence' : [0x44, ['unsigned long']],
        'NumOutstandingMessages' : [0x48, ['unsigned long']],
        'ShutdownLevel' : [0x4c, ['unsigned long']],
        'ShutdownFlags' : [0x50, ['unsigned long']],
        'Luid' : [0x54, ['_LUID']],
        'ServerDllPerProcessData' : [0x5c, [
            'array', 1, ['pointer', ['void']]]],
        }],
    }

winsrv_types_x64 = {
    '_COMMAND': [None, {
        'CmdLength': [0x00, ['unsigned short']],
        'Cmd' : [0x02, ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.CmdLength)]],
        }],
    '_COMMAND_HISTORY': [None, {
        'Flags' : [0x00, ['Flags', {
            'bitmap': {'Allocated': 0, 'Reset': 1}}]],
        'ListEntry': [0x08, ['_LIST_ENTRY']],
        'Application': [0x18, ['pointer', [
            'UnicodeString', dict(
                encoding='utf16',
                length=256)]]],
        'CommandCount': [0x20, ['short']],
        'LastAdded': [0x22, ['short']],
        'LastDisplayed': [0x24, ['short']],
        'FirstCommand': [0x26, ['short']],
        'CommandCountMax': [0x28, ['short']],
        'ProcessHandle': [0x30, ['unsigned int']],
        'PopupList': [0x38, ['_LIST_ENTRY']],
        'CommandBucket': [0x48, [
            'array', lambda x: x.CommandCount, [
                'pointer', ['_COMMAND']]]],
        }],
    '_ALIAS': [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'SourceLength': [0x10, ['unsigned short']],
        'TargetLength': [0x12, ['unsigned short']],
        'Source': [0x14, ['pointer', [
            'UnicodeString', dict(
                encoding='utf16',
                length=lambda x: x.SourceLength * 2)]]],
        'Target': [0x1C, ['pointer', ['UnicodeString', dict(
            encoding='utf16',
            length=lambda x: x.TargetLength * 2)]]],
        }],
    '_EXE_ALIAS_LIST' : [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'ExeLength': [0x10, ['unsigned short']],
        'ExeName': [0x12, ['pointer', [
            'UnicodeString', dict(
                encoding='utf16',
                length=lambda x: x.ExeLength * 2)]]],
        'AliasList': [0x1A, ['_LIST_ENTRY']],
        }],
    '_POPUP_LIST' : [None, {
        'ListEntry' : [0x00, ['_LIST_ENTRY']],
        }],
    '_CONSOLE_INFORMATION': [None, {
        'CurrentScreenBuffer': [0xE8, ['pointer', ['_SCREEN_INFORMATION']]],
        'ScreenBuffer': [0xF0, ['pointer', ['_SCREEN_INFORMATION']]],
        'HistoryList': [0x188, ['_LIST_ENTRY']],
        'ProcessList': [0x178, ['_LIST_ENTRY']],
        'ExeAliasList': [0x198, ['_LIST_ENTRY']],
        'HistoryBufferCount': [0x1A8, ['unsigned short']],
        'HistoryBufferMax': [0x1AA, ['unsigned short']],
        'CommandHistorySize': [0x1AC, ['unsigned short']],
        'OriginalTitle': [0x1B0, ['pointer', [
            'UnicodeString', dict(
                encoding='utf16', length=256)]]],
        'Title': [0x1B8, ['pointer', [
            'UnicodeString', dict(
                encoding='utf16', length=256)]]],
        }],
    '_CONSOLE_PROCESS': [None, {
        'ListEntry': [0x00, ['_LIST_ENTRY']],
        'ProcessHandle': [0x10, ['unsigned int']],
        'Process': [0x18, ['pointer', ['_CSR_PROCESS']]],
        }],
    '_SCREEN_INFORMATION': [None, {
        'Console': [0x00, ['pointer', ['_CONSOLE_INFORMATION']]],
        'ScreenX': [0x28, ['short']],
        'ScreenY': [0x2A, ['short']],
        'Rows': [0x68, ['pointer', [
            'array', lambda x: x.ScreenY, ['_ROW']]]],
        'Next': [0x128, ['pointer', ['_SCREEN_INFORMATION']]],
        }],
    '_ROW': [0x28, {
        'Chars': [0x08, ['pointer', [
            'UnicodeString', dict(
                encoding='utf16',
                length=256)]]],
        }],

    # this is a public PDB
    '_CSR_PROCESS' : [0x60, {
        'ClientId' : [0x0, ['_CLIENT_ID']],
        'ListLink' : [0x8, ['_LIST_ENTRY']],
        'ThreadList' : [0x10, ['_LIST_ENTRY']],
        'NtSession' : [0x18, ['pointer', ['_CSR_NT_SESSION']]],
        'ClientPort' : [0x1c, ['pointer', ['void']]],
        'ClientViewBase' : [0x20, ['pointer', ['unsigned char']]],
        'ClientViewBounds' : [0x24, ['pointer', ['unsigned char']]],
        'ProcessHandle' : [0x28, ['pointer', ['void']]],
        'SequenceNumber' : [0x2c, ['unsigned long']],
        'Flags' : [0x30, ['unsigned long']],
        'DebugFlags' : [0x34, ['unsigned long']],
        'ReferenceCount' : [0x38, ['unsigned long']],
        'ProcessGroupId' : [0x3c, ['unsigned long']],
        'ProcessGroupSequence' : [0x40, ['unsigned long']],
        'LastMessageSequence' : [0x44, ['unsigned long']],
        'NumOutstandingMessages' : [0x48, ['unsigned long']],
        'ShutdownLevel' : [0x4c, ['unsigned long']],
        'ShutdownFlags' : [0x50, ['unsigned long']],
        'Luid' : [0x54, ['_LUID']],
        'ServerDllPerProcessData' : [0x5c, [
            'array', 1, ['pointer', ['void']]]],
        }],
    }

class _CONSOLE_INFORMATION(obj.Struct):
    """ object class for console information structs """

    def get_screens(self):
        """Generator for screens in the console.

        A console can have multiple screen buffers at a time,
        but only the current/active one is displayed.

        Multiple screens are tracked using the singly-linked
        list _SCREEN_INFORMATION.Next.

        See CreateConsoleScreenBuffer
        """
        screens = [self.CurrentScreenBuffer]

        if self.ScreenBuffer not in screens:
            screens.append(self.ScreenBuffer)

        for screen in screens:
            cur = screen
            while cur and cur.v() != 0:
                yield cur
                cur = cur.Next.dereference()

class _SCREEN_INFORMATION(obj.Struct):
    """ object class for screen information """

    def get_buffer(self, truncate=True):
        """Get the screen buffer.

        The screen buffer is comprised of the screen's Y
        coordinate which tells us the number of rows and
        the X coordinate which tells us the width of each
        row in characters. These together provide all of
        the input and output that users see when the
        console is displayed.

        @param truncate: True if the empty rows at the
        end (i.e. bottom) of the screen buffer should be
        supressed.
        """
        rows = []

        for _, row in enumerate(self.Rows.dereference()):
            if row.Chars.is_valid():
                rows.append(unicode(row.Chars.dereference())[0:self.ScreenX])

        # To truncate empty rows at the end, walk the list
        # backwards and get the last non-empty row. Use that
        # row index to splice. An "empty" row isn't just ""
        # as one might assume. It is actually ScreenX number
        # of space characters

        if truncate:
            non_empty_index = 0
            for index, row in enumerate(reversed(rows)):
                ## It seems that when the buffer width is greater than 128
                ## characters, its truncated to 128 in memory.
                if row.count(" ") != min(self.ScreenX, 128):
                    non_empty_index = index
                    break
            if non_empty_index == 0:
                rows = []
            else:
                rows = rows[0:len(rows) - non_empty_index]

        return rows


class WinSrv86(basic.Profile32Bits, basic.BasicClasses):
    """A domain specific profile for the xp, 2008."""

    def __init__(self, **kwargs):
        super(WinSrv86, self).__init__(**kwargs)
        self.add_types(common_types)
        self.add_types(winsrv_types_x86)
        self.add_classes({
            '_CONSOLE_INFORMATION': _CONSOLE_INFORMATION,
            '_SCREEN_INFORMATION': _SCREEN_INFORMATION,
            })


class WinSrv64(basic.ProfileLLP64, basic.BasicClasses):
    """A domain specific profile for the xp, 2008."""

    def __init__(self, **kwargs):
        super(WinSrv64, self).__init__(**kwargs)
        self.add_types(common_types_64)
        self.add_types(winsrv_types_x64)
        self.add_classes({
            '_CONSOLE_INFORMATION': _CONSOLE_INFORMATION,
            '_SCREEN_INFORMATION': _SCREEN_INFORMATION,
            })


class ConHost86(basic.Profile32Bits, basic.BasicClasses):
    """A domain specific profile for windows 7."""

    def __init__(self, **kwargs):
        super(ConHost86, self).__init__(**kwargs)
        self.add_types(common_types)
        self.add_types(conhost_types_x86)
        self.add_classes({
            '_CONSOLE_INFORMATION': _CONSOLE_INFORMATION,
            '_SCREEN_INFORMATION': _SCREEN_INFORMATION,
            })


class ConHost64(basic.ProfileLLP64, basic.BasicClasses):
    """A domain specific profile for windows 7."""

    def __init__(self, **kwargs):
