# Rekall Memory Forensics
# Copyright (C) 2007,2008 Volatile Systems
# Copyright (C) 2010,2011,2012 Michael Hale Ligh <michael.ligh@mnin.org>
# Copyright 2013 Google Inc. All Rights Reserved.
#
# This program is free software; you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation; either version 2 of the License, or (at
# your option) any later version.
#
# This program is distributed in the hope that it will be useful, but
# WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
# General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program; if not, write to the Free Software
# Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
#

# pylint: disable=protected-access

import logging
from rekall import utils
from rekall import obj
from rekall.plugins.overlays import basic
from rekall.plugins.overlays.windows import common
from rekall.plugins.windows.gui import constants


class _MM_SESSION_SPACE(obj.Struct):
    """A class for session spaces"""

    def processes(self):
        """Generator for processes in this session.

        A process is always associated with exactly
        one session.
        """
        for p in self.ProcessList.list_of_type(
            "_EPROCESS", "SessionProcessLinks"):
            yield p


        """Give ourselves an atom cache for quick lookups"""
        self.atom_cache = {}
        super(_RTL_ATOM_TABLE, self).__init__(**kwargs)

    def is_valid(self):
        """Check for validity based on the atom table signature
        and the maximum allowed number of buckets"""
        return (super(_RTL_ATOM_TABLE, self).is_valid() and
                self.Signature == 0x6d6f7441 and
                self.NumBuckets < 0xFFFF)

    def atoms(self, vm=None):
        """Carve all atoms out of this atom table"""
        # The default hash buckets should be 0x25
        for bkt in self.Buckets:
            cur = bkt.dereference(vm=vm)
            while cur.is_valid() and cur.v(vm=vm) != 0:
                yield cur
                cur = cur.HashLink.dereference(vm=vm)

    def find_atom(self, atom_to_find):
        """Find an atom by its ID.

        @param atom_to_find: the atom ID (ushort) to find

        @returns an _RTL_ATOM_TALE_ENTRY object
        """

        # Use the cached results if they exist
        if self.atom_cache:
            return self.atom_cache.get(atom_to_find.v(), None)

        # Build the atom cache
        self.atom_cache = dict(
                (atom.Atom.v(), atom) for atom in self.atoms())

        return self.atom_cache.get(atom_to_find.v(), None)


class _RTL_ATOM_TABLE_ENTRY(obj.Struct):
    """A class for atom table entries"""

    @property
    def Pinned(self):
        """Returns True if the atom is pinned"""
        return self.Flags == 1

    def is_string_atom(self):
        """Returns True if the atom is a string atom
        based on its atom ID.

        A string atom has ID 0xC000 - 0xFFFF
        """
        return self.Atom >= 0xC000 and self.Atom <= 0xFFFF

    def is_valid(self):
        """Perform some sanity checks on the Atom"""
        if not super(_RTL_ATOM_TABLE_ENTRY, self).is_valid():
            return False

        # There is only one flag (and zero)
        if self.Flags not in (0, 1):
            return False
        # There is a maximum name length enforced
        return self.NameLength <= 255


class Win32GUIProfile(obj.ProfileModification):
    """Install win32 gui specific modifications."""

    @classmethod
    def modify(cls, profile):
        pass


class Win32kPluginMixin(object):
    """A mixin which loads the relevant win32k profile."""

    @classmethod
    def args(cls, parser):
        super(Win32kPluginMixin, cls).args(parser)
        parser.add_argument("--win32k_guid", default=None,
                            help="Force this profile to be used for Win32k.")

    def __init__(self, win32k_guid=None, **kwargs):
        super(Win32kPluginMixin, self).__init__(**kwargs)
        if self.session.win32k_profile:
            # Get the profile from the session cache.
            self.profile = self.session.win32k_profile

        else:
            # Find the proper win32k profile and merge in with this kernel
            # profile.
            if win32k_guid is None:
                scanner = self.session.plugins.version_scan(name_regex="win32k")
                for _, guid in scanner.ScanVersions():
                    try:
                        win32k_profile = self.session.LoadProfile(
                            "GUID/%s" % guid)
                        break

                    except IOError:
                        logging.info(
                            "Unable to find profile for win32k.sys: %s.", guid)

                        raise RuntimeError("No profile")

            else:
                win32k_profile = self.session.LoadProfile(win32k_guid)

            # The win32k types and kernel types interact with each other, so we
            # merge them here into a single profile.
            self.profile.merge(win32k_profile)
            self.session.win32k_profile = self.profile


class Win32k(basic.BasicClasses):
    """A profile for the Win32 GUI system."""

    METADATA = dict(os="windows")

    @classmethod
    def Initialize(cls, profile):
        super(Win32k, cls).Initialize(profile)

        # Select basic compiler model type.
        if profile.metadata("arch") == "AMD64":
            basic.ProfileLLP64.Initialize(profile)

        elif profile.metadata("arch") == "I386":
            basic.Profile32Bits.Initialize(profile)

        # Some constants - These will probably change in win8 which does not
        # allow non ascii tags.
        profile.add_constants(PoolTag_WindowStation="Win\xe4",
                              PoolTag_Atom="AtmT")

        profile.add_classes({
            'tagWINDOWSTATION': tagWINDOWSTATION,
            'tagDESKTOP': tagDESKTOP,
            '_RTL_ATOM_TABLE': _RTL_ATOM_TABLE,
            '_RTL_ATOM_TABLE_ENTRY': _RTL_ATOM_TABLE_ENTRY,
            'tagTHREADINFO': tagTHREADINFO,
            'tagHOOK': tagHOOK,
            '_LARGE_UNICODE_STRING': common._UNICODE_STRING,
            'tagWND': tagWND,
            'tagSHAREDINFO': tagSHAREDINFO,
            '_HANDLEENTRY': _HANDLEENTRY,
            'tagEVENTHOOK': tagEVENTHOOK,
            'tagRECT': tagRECT,
            'tagCLIPDATA': tagCLIPDATA,
            })

        version = ".".join(profile.metadatas('major', 'minor'))
        architecture = profile.metadata("arch")

        ## Windows 7 and above
        if version >= "6.1":
            num_handles = len(constants.HANDLE_TYPE_ENUM_SEVEN)
        else:
            num_handles = len(constants.HANDLE_TYPE_ENUM)

        # Add autogenerated vtypes for the different versions.
        if version.startswith("6.1"):  # Windows 7
            from rekall.plugins.windows.gui.vtypes import win7

            profile = win7.Win32GUIWin7.modify(profile)
        else:
            from rekall.plugins.windows.gui.vtypes import xp

            profile = xp.XP2003x86BaseVTypes.modify(profile)

        # The type we want to use is not the same as the one already defined
        # see http://code.google.com/p/volatility/issues/detail?id=131
        profile.add_overlay({
                'gahti': [None, {
                        'types': [0, ['Array', dict(
                                    count=num_handles,
                                    target='tagHANDLETYPEINFO')]],
                        }],

                '_RTL_ATOM_TABLE': [None, {
                        'Signature': [0x0, ['unsigned long']],
                        'NumBuckets': [0xC, ['unsigned long']],
                        'Buckets': [0x10, ['Array', dict(
                                    count=lambda x: x.NumBuckets,
                                    target="Pointer",
                                    target_args=dict(
                                        target='_RTL_ATOM_TABLE_ENTRY')
                                    )]],
                        }],
                '_RTL_ATOM_TABLE_ENTRY': [None, {
                        'Name': [None, ['UnicodeString', dict(
                                    encoding='utf16',
                                    length=lambda x: x.NameLength * 2)]],
                        }],
                'tagWIN32HEAP': [None, {
                        'Heap': [0, ['_HEAP']],
                        }],
                'tagCLIPDATA' : [None, {
                        'cbData' : [0x08, ['unsigned int']],
                        'abData' : [0x0C, ['Array', dict(
                                    count=lambda x: x.cbData,
                                    target='unsigned char')]],
                        }],
                'tagEVENTHOOK' : [0x30, {
                        'phkNext' : [0xC, ['pointer', ['tagEVENTHOOK']]],
                        'eventMin' : [0x10, ['Enumeration', dict(
                                    target='unsigned long',
                                    choices=constants.EVENT_ID_ENUM)]],

                        'eventMax' : [0x14, ['Enumeration', dict(
                                    target='unsigned long',
                                    choices=constants.EVENT_ID_ENUM)]],

                        'dwFlags' : [0x18, ['unsigned long']],
                        'idProcess' : [0x1C, ['unsigned long']],
                        'idThread' : [0x20, ['unsigned long']],
                        'offPfn' : [0x24, ['Pointer', dict(target="Void")]],
                        'ihmod' : [0x28, ['long']],
                        }],

                'tagHANDLETYPEINFO' : [12, {
                        'fnDestroy' : [0, ['pointer', ['void']]],
                        'dwAllocTag' : [4, ['String', dict(length=4)]],
                        'bObjectCreateFlags' : [8, ['Flags', dict(
                                    target='unsigned char',
                                    bitmap={
                                        'OCF_THREADOWNED': 0,
                                        'OCF_PROCESSOWNED': 1,
                                        'OCF_MARKPROCESS': 2,
                                        'OCF_USEPOOLQUOTA': 3,
                                        'OCF_DESKTOPHEAP': 4,
                                        'OCF_USEPOOLIFNODESKTOP': 5,
                                        'OCF_SHAREDHEAP': 6,
                                        'OCF_VARIABLESIZE': 7}
                                    )]],
                        }],
                })

        # The 64 bit versions of these structs just have their members in
        # different offsets.
        if architecture == "AMD64":
            profile.add_overlay({
                    '_RTL_ATOM_TABLE': [None, {
                            'NumBuckets': [0x18, ['unsigned long']],
                            'Buckets': [0x20, ['Array', dict(
                                        count=lambda x: x.NumBuckets,
                                        target="Pointer",
                                        target_args=dict(
                                            target='_RTL_ATOM_TABLE_ENTRY')
                                        )]],
                            }],

                    'tagCLIPDATA' : [None, {
                            'cbData' : [0x10, None],
                            'abData' : [0x14, None],
                            }],
                    'tagEVENTHOOK' : [0x60, {
                            'phkNext' : [0x18, None],
                            'eventMin' : [0x20, None],
                            'eventMax' : [0x24, None],
                            'dwFlags' : [0x28, None],
                            'idProcess' : [0x2C, None],
                            'idThread' : [0x30, None],
                            'offPfn' : [0x40, None],
                            'ihmod' : [0x48, None],
                            }],
                    'tagHANDLETYPEINFO' : [16, {
                            'dwAllocTag' : [8, None],
                            'bObjectCreateFlags' : [12, None],
                            }],
                    })

        # This field appears in the auto-generated vtypes for all OS except XP
        if architecture == "I386" and version[:2] == (5, 1):
            profile.add_overlay({
                    '_MM_SESSION_SPACE': [None, {
                            # nt!MiDereferenceSession
                            'ResidentProcessCount': [0x248, ['long']],
                            }]})

        return profile
