---
layout: docs
category: developers
title: The Rekall Memory Forensic Framework API.
author: Michael Cohen <scudette@gmail.com>
---

:toc:
:icons:
:numbered:
:website: http://www.rekall-forensic.com

Rekall is a powerful framework with many components. It is not necessary to be
intimately familiar with all components to be able to contribute. This document
attempts to cover as much internal API information as possible, but if you
already have a good idea of what you wish to accomplish, the
<<overview,Overview>> section will direct new users to the most relevant
section.

[[overview]]
Overview
--------

The following usage examples are typical areas where people would like to
contribute:

Adding support to a new image format::
 You will probably want to add a new address space by reading
 <<as,Address Spaces>>.

Using rekall as a library::
 You will want to read the section <<library,Using Rekall as a Libarary>>.

I want to add new functionality::
 If your code will be useful to all Rekall users and you would like to
 contribute it upstream you might want to read <<commands,Command Plugins>>, else
 you might want to write a standalone script and read <<library,Using Rekall
 as a Library>>.

[[commands]]
Plugins and Commands.
---------------------

Rekall is a modular framework. This means that most of the functionality of
the framework is implemented by plugins, enabling the framework to support
multiple operating systems. Even when using rekall as a library it is easy

behaviours at specified memory addresses). The Rekall `object system` is built
on top of the base class found in `rekall.obj.BaseObject()`:

[source,python]
------------------------------------------------------------------------
class BaseObject(object):
    def __init__(self, theType=None, offset=0, vm=None, profile=None,
                 parent=None, name='', context=None, **kwargs):
        """Constructor for Base object.

        Args:

          theType: The name of the type of this object. This different
             from the class name, since the same class may implement many types
             (e.g. Struct implements every instance in the vtype definition).

          offset: The offset within the address space to this object exists.

          vm: The address space this object uses to read itself from.

          profile: The profile this object may use to dereference other
           types.

          parent: The object which created this object.

          name: The name of this object.

          context: An opaque dict which is passed to all objects created from
            this object. This dict may contain context specific information
            which each derived instance can use.

          kwargs: Arbitrary args this object may accept - these can be passed in
             the vtype language definition.
        """
....
------------------------------------------------------------------------

So in order to instantiate a Rekall object, we need to provide at a minimum an
address space to read and an offset of where in the address space to read. More
complex objects may require more parameters. For example, to define a `Struct`
class we also need to provide the list of members and the total size of the
struct:

[source,python]
------------------------------------------------------------------------
class Struct(BaseAddressComparisonMixIn, BaseObject):
    """ A Struct is an object which represents a c struct

    Structs have members at various fixed relative offsets from our own base
    offset.
    """
    def __init__(self, members = None, struct_size = 0, **kwargs):
       ....

class String(obj.StringProxyMixIn, obj.NativeType):
    """Class for dealing with Null terminated C Strings.
    """
    def __init__(self, length = 1024, term="\x00", **kwargs):
        ....

class Pointer(NativeType):
    """A pointer reads an 'address' object from the address space."""

    def __init__(self, target=None, target_args=None, value=None, **kwargs):
        """Constructor.

        Args:
           target: The name of the target object (A string). We use the profile
             to instantiate it.
           target_args: The target will receive these as kwargs.
        """
        ....
------------------------------------------------------------------------

In the above examples of Rekall objects, new keyword args are introduced which
are specific for each new type. Note in particular the use the keyword arg
`target` and `target_args` which by convention are used for any class which will
instantiate some other class. For example, the pointer is told which class will
be instantiated upon de-referencing the pointer (i.e. which object it is
pointing to). Similarly the Array() object is told which object will be
constructed at each slot of the array. We try to be consistent with the keyword
naming to make remembering of these keywords easier.

The object system allows us to instantiate high level objects at specified
offsets in the address space. However, this is not very convenient to do by hand
since we would need to know where in the address space we should instantiate
each object ourselves. What we need is a way to control the creation of Rekall
object automatically by using debug symbol information. This is done through the
`profile` object, and its `vtype language` definitions.


The VTypes language.
~~~~~~~~~~~~~~~~~~~~

In order to control object creation automatically, we need to describe how they
are to be created. This description is termed the `vtypes language`. It is
really a data driven description of how to create instances of the `Struct()`
class.

The precise format of a `vtype language` struct definition is as follows:

[source,python]
------------------------------------------------------------------------
#     <1>            <2>
"Struct Name": [Struct Size: {
#        <3>             <4>            <5>             <6>
    "Member name": [Member Offset, ["Class Name", Keyword Args]],
   }]
------------------------------------------------------------------------

<1> This is the name of the struct we are describing.

<2> This is the total size of the struct. This is used for example, when
    constructing an array of objects.

<3> The name of the field in the struct.

<4> The field's offset relative to the beginning of the Struct.

<5> When this field is accessed, this class will be instantiated at the
    specified offset (The struct's start address plus the relative offset into
    the struct specified in <4>).

<6> When instantiating this class, we also pass these keyword args to the class
    constructor.


The VTypes language was designed to allow:

- Partial definition of struct members - not all members in the struct must be
  defined. The offset of the member in the struct is explicitly given. This
  allows us to create aliases (i.e. many fields which access the same memory
  location) as well as sparse structs (i.e. structs with only a few fields
  known).

- Struct members are simply names of object classes (inherited from
  obj.BaseObject). These classes take care of actually parsing the data. This
  allows us to interpret the memory offset in arbitrary ways.  These classes are
  instantiated at the required offset.

The following is an example of a vtype definition generated from debugging symbols:

[source,python]
------------------------------------------------------------------------
  '_EPROCESS' : [ 0x270, {                                          #<1>
    'Pcb' : [ 0x0, ['_KPROCESS']],                                  #<2>
    'ProcessLock' : [ 0x80, ['_EX_PUSH_LOCK']],
    'CreateTime' : [ 0x88, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0x90, ['_LARGE_INTEGER']],
    'RundownProtect' : [ 0x98, ['_EX_RUNDOWN_REF']],
    'UniqueProcessId' : [ 0x9c, ['Pointer', dict(target="Void")]],  #<3>
    'ActiveProcessLinks' : [ 0xa0, ['_LIST_ENTRY']],
    'QuotaUsage' : [ 0xa8, ['Array', dict(                          #<4>
                   target='unsigned long',
                   count=3
                   )]],
    'QuotaPeak' : [ 0xb4, ['Array',  dict(
                   target='unsigned long',
                   count=3
                   )]],
    'CommitCharge' : [ 0xc0, ['unsigned long']],
    'PeakVirtualSize' : [ 0xc4, ['unsigned long']],
    'VirtualSize' : [ 0xc8, ['unsigned long']],
    'SessionProcessLinks' : [ 0xcc, ['_LIST_ENTRY']],
------------------------------------------------------------------------

<1> This defines the '_EPROCESS' struct as having a size of 0x270 bytes.

<2> The 'Pcb' member of this struct is found at offset 0 and it is of type
'_KPROCESS'.

<3> The 'UniqueProcessId' member is a pointer to void and is found at offset 0x9c.

<4> The 'QuotaUsage' member is an array which will be instantiated at offset
0xa8 from the start of the _EPROCESS struct. The array will have 3 members each
of type 'unsigned long'.

Overlaying
~~~~~~~~~~

Rekall aims to specify semantic information about each field type. That means that we are really looking for the meaning behind each field, not just the mechanics of how to parse it. For example, the following struct may be defined in C:

[source,c]
------------------------------------------------------------------------
struct module
{
...
         /* Unique handle for this module */
         char name[MODULE_NAME_LEN];
...
}
------------------------------------------------------------------------

The debugging symbols will generate for this field an array of char objects:

[source,python]
------------------------------------------------------------------------
"module": [0x2FF, {
  'name': [0x4F, ['Array', dict(
          target='char',
          count=60
         )]]
}]
------------------------------------------------------------------------

However, while technically correct, this is not semantically correct. We know
that the array of char objects should really be interpreted as a null terminated
unicode string in UTF8. We know that the offset of this field is correct though,
just that its meaning according to the debug symbols is inaccurate.

The `vtype language` allows specification of `Overlays` to "correct" or adjust
the values of lower layers. In this case we load the debug generated vtype
first, then we load an overlay like:

[source,python]
------------------------------------------------------------------------
    'module' : [None, {
            'name': [None , ['UnicodeString', dict(length = 60)]],
            }],
------------------------------------------------------------------------

Over the top. The overlay may specify a value of None for the offset, or the
struct size positions. This will allow these values to "bubble up" from the
lower level description. However, specifying a new class name will override the
values in the lower vtype description.

In practice this is used to provide higher level semantic information to
existing fields in a version independent manner. The exact offsets of fields is
obtained from the debugging symbols, but semantic meaning is obtained from the
overlay.


The `vtype language` allows recursive definition of field types. This is
encouraged since it leads to semantically readable code which exactly describes
the nature of the memory objects. For example:

[source,python]
------------------------------------------------------------------------
    'module' : [None, {
            'name': [None , ['UnicodeString', dict(length = 60)]],
            'kp': [None, ['Pointer', dict(
                        target='Array',
                        target_args=dict(
                            target='kernel_param',
                            count=lambda x: x.num_kp))]],
            }],
------------------------------------------------------------------------

Specifies the `name` member to be a unicode string of length 60, while the `kp`
field is a pointer to an array of `kernel_param` objects. The array size is
specified in the module's `num_kp` member.

Note that `None` is specified for some fields in this vtype description. This
means that the value in this position will be `overlayed` (or taken from a
previous layer).


In order to simplify the description within the vtypes languages, we can replace
many of the fields with python callables (usually `lambda` ). In the above
example, we specified the `count` parameter of the Array constructor as a
callable fetching the value from the `module` object's `num_kp` field:

- Specifying a callable in place of the struct's size can determine the size
  from the actual struct itself (e.g. if the size is stored in a member).

- Callables in the field offset position specify the offset of the field. Note
  that this is evaluated to the absolute offset.

- Callables in the keyword args field are evaluated when the field is accessed.

By convention, Rekall specifies pure data in the lowest vtype description layer
(usually extracted from debugging symbols), while callables are only specified
in overlays (possibly leaving gaps for the debugging information to bubble
through them). This means that the lowest layer vtype descriptions are purely
data, and can therefore be encoded in a safe format, such as JSON.


.How to generate a windows profile.
*******************************************************************************

To generate a vtypes file for a windows executable, simple use the `fetch_pdb`
and `parse_pdb` plugins. For example, suppose you have a memory image which you
are not quite sure what exact version of Windows it is.

1. The first step is to figure out the precise version of the windows kernel this
