<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
    "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="application/xhtml+xml; charset=UTF-8" />
<meta name="generator" content="AsciiDoc 8.6.8" />
<title>Volatility Technology Preview Developer information</title>
<style type="text/css">
/* Shared CSS for AsciiDoc xhtml11 and html5 backends */

/* Default font. */
body {
  font-family: Georgia,serif;
}

/* Title font. */
h1, h2, h3, h4, h5, h6,
div.title, caption.title,
thead, p.table.header,
#toctitle,
#author, #revnumber, #revdate, #revremark,
#footer {
  font-family: Arial,Helvetica,sans-serif;
}

body {
  margin: 1em 5% 1em 5%;
}

a {
  color: blue;
  text-decoration: underline;
}
a:visited {
  color: fuchsia;
}

em {
  font-style: italic;
  color: navy;
}

strong {
  font-weight: bold;
  color: #083194;
}

h1, h2, h3, h4, h5, h6 {
  color: #527bbd;
  margin-top: 1.2em;
  margin-bottom: 0.5em;
  line-height: 1.3;
}

h1, h2, h3 {
  border-bottom: 2px solid silver;
}
h2 {
  padding-top: 0.5em;
}
h3 {
  float: left;
}
h3 + * {
  clear: left;
}
h5 {
  font-size: 1.0em;
}

div.sectionbody {
  margin-left: 0;
}

hr {
  border: 1px solid silver;
}

p {
  margin-top: 0.5em;
  margin-bottom: 0.5em;
}

ul, ol, li > p {
  margin-top: 0;
}
ul > li     { color: #aaa; }

the session, the plugins will automatically invoke the <em>load_as()</em> plugin.</p></div>
<div class="paragraph"><p>The load_as plugin is just a regular command plugin, which means that it can be
implemented by different plugin.Command() classes (autoselected via the
is_active() class method - see <a href="#commands">Command Plugin</a>). This means we can
have one implementation for windows, one for linux etc. The following discusses
the windows implementation since that is much more complex.</p></div>
<div class="paragraph"><p>The physical address space is derived by an automatic voting algorithm:</p></div>
<div class="olist arabic"><ol class="arabic">
<li>
<p>
Start with the None address space and pass it to all address spaces in their
requested order (classes are sorted by their <em>order</em> attribute). Address spaces
which are incompatible with the base address space will raise ASAssertionError
and will be skipped.
</p>
</li>
<li>
<p>
The first address space which instantiates successfully, will be accepted as
the next base address space.
</p>
</li>
<li>
<p>
The process is repeated until all address spaces failed to instantiate. We then return the last successfully instantiated address space.
</p>
</li>
</ol></div>
<div class="paragraph"><p>In the windows load_as() plugin, the virtual address space is created from the
kernel&#8217;s Directory Table Base (DTB). This is usually obtained by scanning the
image for the Idle process - implemented by the find_dtb() command
plugin. Therefore load_as automatically calls the find_dtb() plugin. In other
implementations, the kernel DTB is calculated using some other way (e.g. from
debug symbols).</p></div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_the_object_parsing_system">4. The object parsing system.</h2>
<div class="sectionbody">
<div class="paragraph"><p>Computers use volatility memory in order to organize data and for program
control. Memory analysis is ultimately all about trying to make sense of a
memory image, and deducing higher level constructs from these.</p></div>
<div class="paragraph"><p>For example, if a C program defines the following struct:</p></div>
<div class="listingblock">
<div class="content">
<pre><code>typedef unsigned char uchar;
enum {
  OPT1,
  OPT2
} options;

struct foobar {
    enum options flags;
    short int bar;
    uchar *foo;
}</code></pre>
</div></div>
<div class="paragraph"><p>What should the memory layout be? The answer is not so simple - it depends on
many things such as the compiler used, architecture etc. For example, the
compiler might enforce an alignment on the struct members by inserting padding
between elements.</p></div>
<div class="paragraph"><p>In practice it is impossible to predict from source code alone what the memory
layout should be. We therefore need the compiler itself to inform us about how
its planning to layout the memory in practice. This information is available
through debug symbol.</p></div>
<div class="admonitionblock">
<table><tr>
<td class="icon">
<img src="images/icons/note.png" alt="Note" />
</td>
<td class="content">
<div class="paragraph"><p>Volatility is in many ways emulating a native debugger. Just like a debugger,
volatility is making sense from the memory image, using debugging symbols.</p></div>
</td>
</tr></table>
</div>
<div class="paragraph"><p>There are basically two types of debugging systems - the Microsoft PDB system
and the DWARF standard.</p></div>
<div class="dlist"><dl>
<dt class="hdlist1">
DWARF
</dt>
<dd>
<p>
  This standard is used mostly on unix like operating systems (and OSX). It
  consists of a DWARF section attached to the binary object (e.g. ELF file) with
  a specially encoded stream providing information about symbols, structures and
  offsets. In order to obtain debugging information, the binary must be rebuilt
  with the appropriate flags.
</p>
</dd>
<dt class="hdlist1">
Microsoft PDB
</dt>
<dd>
<p>
 This standard keeps debugging information outside the final binary. The pdb
 file contains the debugging information, and is stored on a server (may be
 private or public). The advantage of this system is that debugging symbols may
 be obtained for release binaries as well (i.e. you do not need to build with
 debugging turned on before hand).
</p>
</dd>
</dl></div>
<div class="paragraph"><p>Another important concept to understand is that of a <em>Compilation Unit</em>. A
compilation unit is a self consistent unit of compiled code which uses the same
memory layout for structs. For example a DLL or an object file is a compilation
unit. It is important to note that the same struct may be defined with the same
name but different layout in different compilation units without any problem.</p></div>
<div class="sect2">
<h3 id="_the_vtypes_language">4.1. The VTypes language.</h3>
<div class="paragraph"><p>Some symbols may not have debugging information, and so we need to write their
definition by hand (say from reverse engineering the symbol). The VTypes
language was developed as an intuitive way to write human readable structure
definitions.</p></div>
<div class="paragraph"><p>The VTypes language was designed to allow:</p></div>
<div class="ulist"><ul>
<li>
<p>
Partial definition of struct members - not all members in the struct must be
  defined. The offset of the member in the struct is explicitly given.
</p>
</li>
<li>
<p>
Struct members are simply names of special classes (inherited from
  obj.BaseObject). These classes take care of actually parsing the data. This
  allows us to interpret the memory offset in arbitrary ways.  These classes are
  instantiated at the required offset.
</p>
</li>
</ul></div>
<div class="paragraph"><p>The following is an example of a vtype definition:</p></div>
<div class="listingblock">
<div class="content">
<pre><code>  '_EPROCESS' : [ 0x270, {                                          <img src="images/icons/callouts/1.png" alt="1" />
    'Pcb' : [ 0x0, ['_KPROCESS']],                                  <img src="images/icons/callouts/2.png" alt="2" />
    'ProcessLock' : [ 0x80, ['_EX_PUSH_LOCK']],
    'CreateTime' : [ 0x88, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0x90, ['_LARGE_INTEGER']],
    'RundownProtect' : [ 0x98, ['_EX_RUNDOWN_REF']],
    'UniqueProcessId' : [ 0x9c, ['Pointer', dict(target="Void")]],  <img src="images/icons/callouts/3.png" alt="3" />
    'ActiveProcessLinks' : [ 0xa0, ['_LIST_ENTRY']],
    'QuotaUsage' : [ 0xa8, ['Array', dict(                          <img src="images/icons/callouts/4.png" alt="4" />
                   target='unsigned long',
                   count=3
                   )]],
    'QuotaPeak' : [ 0xb4, ['Array',  dict(
                   target='unsigned long',
                   count=3
                   )]],
    'CommitCharge' : [ 0xc0, ['unsigned long']],
    'PeakVirtualSize' : [ 0xc4, ['unsigned long']],
    'VirtualSize' : [ 0xc8, ['unsigned long']],
    'SessionProcessLinks' : [ 0xcc, ['_LIST_ENTRY']],</code></pre>
</div></div>
<div class="colist arabic"><table>
<tr><td><img src="images/icons/callouts/1.png" alt="1" /></td><td>
This defines the <em>_EPROCESS</em> struct as having a size of 0x270 bytes.
</td></tr>
<tr><td><img src="images/icons/callouts/2.png" alt="2" /></td><td>
The <em>Pcb</em> member of this struct is found at offset 0 and it is of type
<em>_KPROCESS</em>.
</td></tr>
<tr><td><img src="images/icons/callouts/3.png" alt="3" /></td><td>
The <em>UniqueProcessId</em> member is a pointer to void and is found at offset 0x9c.
</td></tr>
<tr><td><img src="images/icons/callouts/4.png" alt="4" /></td><td>
The <em>QuotaUsage</em> member is an array which will be instantiated at offset
0xa8 from the start of the _EPROCESS struct. The array will have 3 members each
of type <em>unsigned long</em>.
</td></tr>
</table></div>
<div class="admonitionblock">
<table><tr>
<td class="icon">
<img src="images/icons/tip.png" alt="Tip" />
</td>
<td class="content">
<div class="paragraph"><p>To generate a vtypes file for an executable, simple use the pdbparse project to
fetch the pdb for the binary and convert it to vtypes:</p></div>
<div class="listingblock">
<div class="content">
<pre><code>pdbparse/trunk$ python examples/symchk.py ntoskrnl.exe
Trying http://msdl.microsoft.com/download/symbols/ntkrnlmp.pdb/7A6629B2016A41D3A5D3E7129430544D2/ntkrnlmp.pd_
Connected. Downloading data...
0% 5% 10% 15% 20% 25% 30% 35% 40% 45% 50% 55% 60% 65% 70% 75% 80% 85% 90% 95% 100%
Saved symbols to ntkrnlmp.pd_
Extracting cabinet: ntkrnlmp.pd_
  extracting ntkrnlmp.pdb

All done, no errors.
pdbparse/trunk$ python examples/tpi_vtypes.py ntkrnlmp.pdb &gt; ntkrnlmp.py
pdbparse/trunk$ head ntkrnlmp.py
ntkrnlmp_types = {
  'LIST_ENTRY64' : [ 0x10, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'Blink' : [ 0x8, ['unsigned long long']],
} ],
  'LIST_ENTRY32' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long']],
    'Blink' : [ 0x4, ['unsigned long']],
} ],
  '_KUSER_SHARED_DATA' : [ 0x5f0, {</code></pre>
</div></div>
</td>
</tr></table>
</div>
<div class="paragraph"><p>Usually vtypes are automatically generated from debug information, such as PDB
files or DWARF file. It is not enough to specify this information in practice
however, since PDB files may be incomplete, or just incorrect.</p></div>
<div class="paragraph"><p>Volatility allows vtypes to be overlayed. This means that some fields in
autogenerated definitions can be overridden by user defined <em>overlays</em>. For
example consider the vtype definition generated from debugging symbols:</p></div>
<div class="listingblock">
<div class="content">
<pre><code>'_EPROCESS' : [ 0x4d0, {
    'Pcb' : [ 0x0, ['_KPROCESS']],
    'ProcessLock' : [ 0x160, ['_EX_PUSH_LOCK']],
    'CreateTime' : [ 0x168, '_LARGE_INTEGER']],
    'ExitTime' : [ 0x170, ['_LARGE_INTEGER']],
    .....
}],</code></pre>
</div></div>
<div class="paragraph"><p>Although technically CreateTime is stored as a _LARGE_INTEGER, semantically it
is interpreted as a timestamp. We therefore apply the following overlay:</p></div>
<div class="listingblock">
<div class="content">
<pre><code>'_EPROCESS' : [ None, {
    'CreateTime' : [ None, ['WinTimeStamp', {}]]],
    'ExitTime' : [ None, ['WinTimeStamp', {}]],
    .....
}],</code></pre>
</div></div>
<div class="paragraph"><p>Note how the overlay does not actually specify the struct offset of the fields -
these are still obtained from the debugging symbols. We only specify the
semantic meaning of these fields - information which is not captured in the
debugging symbols.</p></div>
<div class="paragraph"><p>The WinTimeStamp object is a class which extends the basic BaseObject to provide
special methods to handle the value as a timestamp.</p></div>
<div class="paragraph"><p>The Volatility object parsing system is the workhorse under the entire
volatility system. It is used to build semantic information from the underlying
memory data by combining debug symbols (for offsets) with user provided semantic
meaning (using overlays and high level classes).</p></div>
</div>
<div class="sect2">
<h3 id="_the_profile">4.2. The Profile.</h3>
<div class="paragraph"><p>A profile is an object which unifies semantic information about a particular
compilation unit. The profile is built by applying all relevant overlays and
classes to parse the compilation unit it cares about. For example the following
is a base profile for parsing the Windows kernel:</p></div>
<div class="listingblock">
<div class="content">
<pre><code>class BaseWindowsProfile(basic.BasicWindowsClasses):
    """Common symbols for all of windows kernel profiles."""
    _md_os = "windows"

    def __init__(self, **kwargs):
        super(BaseWindowsProfile, self).__init__(**kwargs)

        self.add_classes({
            '_UNICODE_STRING': _UNICODE_STRING,
            '_EPROCESS': _EPROCESS,
            '_MMVAD_FLAGS2': _MMVAD_FLAGS2,
            '_MMSECTION_FLAGS': _MMSECTION_FLAGS,
            })

        self.add_overlay(windows_overlay)

        # Pooltags for common objects.
        self.add_constants(DRIVER_POOLTAG="Dri\xf6",
                           EPROCESS_POOLTAG="Pro\xe3",
                           THREAD_POOLTAG='\x54\x68\x72\xe5',
                           )</code></pre>
</div></div>
<div class="paragraph"><p>We can see this profile is applying classes, overlays and constants to the
profile. Viewed as a whole, the profile can be said to implement a parsing
system for the windows kernel.  When a user select the profile with the
--profile command line arg, they are really selecting which profile should be
created for parsing the kernel.</p></div>
</div>
<div class="sect2">
<h3 id="_profile_modifications">4.3. Profile Modifications</h3>
<div class="paragraph"><p>The profile is a self contained system for parsing the kernel data
structures. However, some modules would like to alter the profile slightly - for
example to add new classes replacing the default classes (with additional
methods), or maybe adding new information obtained by reverse engineering
certain data structures. In these cases we wish to <em>modify</em> the profile
definition by adding an improved class definition system.</p></div>
<div class="paragraph"><p>It is normally discouraged to directly add new BaseObject class implementations
to the volatility framework since the changes will appear in all users of the
profile - potentially clashing with others' modifications. In other words we
want to modify the profile only for the users of this profile.</p></div>
<div class="paragraph"><p>This can be done by explicitly calling the ProfileModification class in your
plugin. This will install the updated implementation in your profile - without
