Volatility Technology Preview Developer information
===================================================
Michael Cohen <scudette@gmail.com>
September 2012
:toc2:
:icons:
:numbered:


Volatility is a powerful framework with many components. It is not necessary to
be intimately familiar with all components to be able to contribute. This
document attempts to cover as much internal API information as possible, but if
you already have a good idea of what you wish to accomplish, the
<<overview,Overview>> section will direct new users to the most relevant
section.

[[overview]]
Overview
--------

The following usage examples are typical areas where people would like to
contribute:

Adding support to a new image format::
 You will probably want to add a new address space by reading
 <<as,Address Spaces>>.

Using volatility as a library::
 You will want to read the section <<library,Using Volatility as a Libarary>>.

I want to add new functionality::
 If your code will be useful to all Volatility users and you would like to
 contribute it upstream you might want to read <<commands,Command Plugins>>, else
 you might want to write a standalone script and read <<library,Using Volatility
 as a Libarary>>.

[[commands]]
Plugins and Commands.
---------------------

Volatility is a modular framework. This means that most of the functionality of
the framework is implemented by plugins, enabling the framework to support

 skip unmapped regions. This function basically returns a list of ranges which
 are valid.


Many image file formats implement essentially a sparse file (i.e. the image
consists of sections which are stored back to back but which refer to sparse
memory regions.). To make it easier to support these there is a generic
RunBasedAddressSpace. Extending this class and populating the self.runs array
with the mappings from virtual space to physical space is all that is required
to support these image file formats. Currents the address spaces which are
supported in this way are WindowsCrashDumpSpace, Elf64CoreDump (for virtual
box), MACHOCoreDump (for osx).


Automatic Address Space Selection
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Most volatility plugins expect to have valid address spaces set in the session
object before they run. There are two main session parameters which are commonly
required, the 'session.physical_address_space' and
'session.kernel_address_space'. Usually if these parameters are not provided in
the session, the plugins will automatically invoke the 'load_as()' plugin.


The load_as plugin is just a regular command plugin, which means that it can be
implemented by different plugin.Command() classes (autoselected via the
is_active() class method - see <<commands,Command Plugin>>). This means we can
have one implementation for windows, one for linux etc. The following discusses
the windows implementation since that is much more complex.

The physical address space is derived by an automatic voting algorithm:

1. Start with the None address space and pass it to all address spaces in their
requested order (classes are sorted by their 'order' attribute). Address spaces
which are incompatible with the base address space will raise ASAssertionError
and will be skipped.

2. The first address space which instantiates successfully, will be accepted as
the next base address space.

3. The process is repeated until all address spaces failed to instantiate. We then return the last successfully instantiated address space.

In the windows load_as() plugin, the virtual address space is created from the
kernel's Directory Table Base (DTB). This is usually obtained by scanning the
image for the Idle process - implemented by the find_dtb() command
plugin. Therefore load_as automatically calls the find_dtb() plugin. In other
implementations, the kernel DTB is calculated using some other way (e.g. from
debug symbols).


The object parsing system.
--------------------------

Computers use volatility memory in order to organize data and for program
control. Memory analysis is ultimately all about trying to make sense of a
memory image, and deducing higher level constructs from these.

For example, if a C program defines the following struct:
------------------------------------------------------------------------
typedef unsigned char uchar;
enum {
  OPT1,
  OPT2
} options;

struct foobar {
    enum options flags;
    short int bar;
    uchar *foo;
}
------------------------------------------------------------------------

What should the memory layout be? The answer is not so simple - it depends on
many things such as the compiler used, architecture etc. For example, the
compiler might enforce an alignment on the struct members by inserting padding
between elements.

In practice it is impossible to predict from source code alone what the memory
layout should be. We therefore need the compiler itself to inform us about how
its planning to layout the memory in practice. This information is available
through debug symbol.

[NOTE]
================================================================================
Volatility is in many ways emulating a native debugger. Just like a debugger,
volatility is making sense from the memory image, using debugging symbols.
================================================================================

There are basically two types of debugging systems - the Microsoft PDB system
and the DWARF standard.

DWARF::
  This standard is used mostly on unix like operating systems (and OSX). It
  consists of a DWARF section attached to the binary object (e.g. ELF file) with
  a specially encoded stream providing information about symbols, structures and
  offsets. In order to obtain debugging information, the binary must be rebuilt
  with the appropriate flags.

Microsoft PDB::
 This standard keeps debugging information outside the final binary. The pdb
 file contains the debugging information, and is stored on a server (may be
 private or public). The advantage of this system is that debugging symbols may
 be obtained for release binaries as well (i.e. you do not need to build with
 debugging turned on before hand).


Another important concept to understand is that of a 'Compilation Unit'. A
compilation unit is a self consistent unit of compiled code which uses the same
memory layout for structs. For example a DLL or an object file is a compilation
unit. It is important to note that the same struct may be defined with the same
name but different layout in different compilation units without any problem.


The VTypes language.
~~~~~~~~~~~~~~~~~~~~

Some symbols may not have debugging information, and so we need to write their
definition by hand (say from reverse engineering the symbol). The VTypes
language was developed as an intuitive way to write human readable structure
definitions.

The VTypes language was designed to allow:

- Partial definition of struct members - not all members in the struct must be
  defined. The offset of the member in the struct is explicitly given.

- Struct members are simply names of special classes (inherited from
  obj.BaseObject). These classes take care of actually parsing the data. This
  allows us to interpret the memory offset in arbitrary ways.  These classes are
  instantiated at the required offset.

The following is an example of a vtype definition:
------------------------------------------------------------------------
  '_EPROCESS' : [ 0x270, {                                          <1>
    'Pcb' : [ 0x0, ['_KPROCESS']],                                  <2>
    'ProcessLock' : [ 0x80, ['_EX_PUSH_LOCK']],
    'CreateTime' : [ 0x88, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0x90, ['_LARGE_INTEGER']],
    'RundownProtect' : [ 0x98, ['_EX_RUNDOWN_REF']],
    'UniqueProcessId' : [ 0x9c, ['Pointer', dict(target="Void")]],  <3>
    'ActiveProcessLinks' : [ 0xa0, ['_LIST_ENTRY']],
    'QuotaUsage' : [ 0xa8, ['Array', dict(                          <4>
                   target='unsigned long',
                   count=3
                   )]],
    'QuotaPeak' : [ 0xb4, ['Array',  dict(
                   target='unsigned long',
                   count=3
                   )]],
    'CommitCharge' : [ 0xc0, ['unsigned long']],
    'PeakVirtualSize' : [ 0xc4, ['unsigned long']],
    'VirtualSize' : [ 0xc8, ['unsigned long']],
    'SessionProcessLinks' : [ 0xcc, ['_LIST_ENTRY']],
------------------------------------------------------------------------

<1> This defines the '_EPROCESS' struct as having a size of 0x270 bytes.

<2> The 'Pcb' member of this struct is found at offset 0 and it is of type
'_KPROCESS'.

<3> The 'UniqueProcessId' member is a pointer to void and is found at offset 0x9c.

<4> The 'QuotaUsage' member is an array which will be instantiated at offset
0xa8 from the start of the _EPROCESS struct. The array will have 3 members each
of type 'unsigned long'.

[TIP]
================================================================================
To generate a vtypes file for an executable, simple use the pdbparse project to
fetch the pdb for the binary and convert it to vtypes:
------------------------------------------------------------------------
pdbparse/trunk$ python examples/symchk.py ntoskrnl.exe
Trying http://msdl.microsoft.com/download/symbols/ntkrnlmp.pdb/7A6629B2016A41D3A5D3E7129430544D2/ntkrnlmp.pd_
Connected. Downloading data...
0% 5% 10% 15% 20% 25% 30% 35% 40% 45% 50% 55% 60% 65% 70% 75% 80% 85% 90% 95% 100%
Saved symbols to ntkrnlmp.pd_
Extracting cabinet: ntkrnlmp.pd_
  extracting ntkrnlmp.pdb

All done, no errors.
pdbparse/trunk$ python examples/tpi_vtypes.py ntkrnlmp.pdb > ntkrnlmp.py
pdbparse/trunk$ head ntkrnlmp.py
ntkrnlmp_types = {
  'LIST_ENTRY64' : [ 0x10, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'Blink' : [ 0x8, ['unsigned long long']],
} ],
  'LIST_ENTRY32' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long']],
    'Blink' : [ 0x4, ['unsigned long']],
} ],
  '_KUSER_SHARED_DATA' : [ 0x5f0, {
------------------------------------------------------------------------

================================================================================

Usually vtypes are automatically generated from debug information, such as PDB
files or DWARF file. It is not enough to specify this information in practice
however, since PDB files may be incomplete, or just incorrect.

Volatility allows vtypes to be overlayed. This means that some fields in
autogenerated definitions can be overridden by user defined 'overlays'. For
example consider the vtype definition generated from debugging symbols:
------------------------------------------------------------------------
'_EPROCESS' : [ 0x4d0, {
    'Pcb' : [ 0x0, ['_KPROCESS']],
    'ProcessLock' : [ 0x160, ['_EX_PUSH_LOCK']],
    'CreateTime' : [ 0x168, '_LARGE_INTEGER']],
    'ExitTime' : [ 0x170, ['_LARGE_INTEGER']],
    .....
}],
------------------------------------------------------------------------

Although technically CreateTime is stored as a _LARGE_INTEGER, semantically it
is interpreted as a timestamp. We therefore apply the following overlay:
------------------------------------------------------------------------
'_EPROCESS' : [ None, {
    'CreateTime' : [ None, ['WinTimeStamp', {}]]],
    'ExitTime' : [ None, ['WinTimeStamp', {}]],
    .....
}],
------------------------------------------------------------------------

Note how the overlay does not actually specify the struct offset of the fields -
these are still obtained from the debugging symbols. We only specify the
semantic meaning of these fields - information which is not captured in the
debugging symbols.

The WinTimeStamp object is a class which extends the basic BaseObject to provide
special methods to handle the value as a timestamp.

The Volatility object parsing system is the workhorse under the entire
volatility system. It is used to build semantic information from the underlying
memory data by combining debug symbols (for offsets) with user provided semantic
meaning (using overlays and high level classes).

The Profile.
~~~~~~~~~~~~

A profile is an object which unifies semantic information about a particular
compilation unit. The profile is built by applying all relevant overlays and
classes to parse the compilation unit it cares about. For example the following
is a base profile for parsing the Windows kernel:

------------------------------------------------------------------------
class BaseWindowsProfile(basic.BasicWindowsClasses):
    """Common symbols for all of windows kernel profiles."""
    _md_os = "windows"

    def __init__(self, **kwargs):
        super(BaseWindowsProfile, self).__init__(**kwargs)

        self.add_classes({
            '_UNICODE_STRING': _UNICODE_STRING,
            '_EPROCESS': _EPROCESS,
            '_MMVAD_FLAGS2': _MMVAD_FLAGS2,
            '_MMSECTION_FLAGS': _MMSECTION_FLAGS,
            })

        self.add_overlay(windows_overlay)

        # Pooltags for common objects.
        self.add_constants(DRIVER_POOLTAG="Dri\xf6",
                           EPROCESS_POOLTAG="Pro\xe3",
                           THREAD_POOLTAG='\x54\x68\x72\xe5',
                           )
------------------------------------------------------------------------

We can see this profile is applying classes, overlays and constants to the
profile. Viewed as a whole, the profile can be said to implement a parsing
system for the windows kernel.  When a user select the profile with the
--profile command line arg, they are really selecting which profile should be
created for parsing the kernel.


Profile Modifications
~~~~~~~~~~~~~~~~~~~~~

The profile is a self contained system for parsing the kernel data
structures. However, some modules would like to alter the profile slightly - for
example to add new classes replacing the default classes (with additional
methods), or maybe adding new information obtained by reverse engineering
certain data structures. In these cases we wish to 'modify' the profile
definition by adding an improved class definition system.

It is normally discouraged to directly add new BaseObject class implementations
to the volatility framework since the changes will appear in all users of the
profile - potentially clashing with others' modifications. In other words we
want to modify the profile only for the users of this profile.

This can be done by explicitly calling the ProfileModification class in your
plugin. This will install the updated implementation in your profile - without
affecting other profiles. This localized change opens the door for multiple
implementations of profile parsing systems.

For example consider the standard registry parsing implementation in
'volatility.plugins.windows.registry.registry'. This implementation is a fast,
